src/main/java/requestFiles/PackageService_GetPackageDetails.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header>
      <CompanyId xmlns="http://jonasfitness.com/Core/">236</CompanyId><CallerContext xmlns="http://jonasfitness.com/Core/">Member</CallerContext></soapenv:Header>
  <soapenv:Body>
      <tem:GetPackageDetails>
         <!--Optional:-->
         <tem:customerId>223</tem:customerId>
         <!--Optional:-->
         <!-- 
         Service Item
         Package = Active
         OnlineSalesAllowed = True
         Barcode Id = TennisBM -->
         <tem:packageId>36</tem:packageId>
         <!--Optional:-->
         <tem:clubNumber>1</tem:clubNumber>
         <!--Optional:-->
         <tem:includeItemRestrictions>false</tem:includeItemRestrictions>
      </tem:GetPackageDetails>
   </soapenv:Body>
</soapenv:Envelope>